#+BEGIN_SRC sage :exports none
  from e8theta_degree3.gl3_repn import gl3_repn_module
#+END_SRC

#+BEGIN_SRC sage :exports results
  for b in gl3_repn_module((13, 12, 0)).basis():
      print b.right_tableau
      print ""
#+END_SRC

#+RESULTS:
#+begin_example
[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3]
[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]
#+end_example
